[
  {
    "title": "Row: 2",
    "order": "",
    "rank": "",
    "image": "StartApple.jpg",
    "overlay": "right",
    "name": "108th Apple Cup: By the Numbers",
    "subhead": "",
    "chatter": "Meetings: 107<p>Record: UW 69-32-2<p>Current streak: UW 2 (2013-14)<p>First meeting: Nov. 30, 1900 (5-5 tie)",
    "youtube": "",
    "etc": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-husky-football/apple-cup-by-the-numbers-pac-12s-top-passing-offense-meets-pac-12s-top-defense/",
    "linktext": "Nation's top passing offense meets Pac-12’s top defense\n",
    "poll": "<script type=\"text/javascript\" language=\"javascript\"\nsrc=\"http://static.polldaddy.com/p/9197411.js\"></script>\n<noscript>\n<a href=\"http://polldaddy.com/poll/9197411/\">Who will win the Apple Cup?</a><br/>\n<span style=\"font:9px;\">(<a href=\"http://www.polldaddy.com\">polls</a>)</span>\n</noscript>\n"
  },
  {
    "title": "1",
    "order": "1",
    "rank": "1",
    "image": "1991AppleCup.jpg",
    "overlay": "right",
    "name": "Nov. 23, 1991: No. 2 UW 56, WSU 21",
    "subhead": "Huskies stay perfect",
    "chatter": "Having already sealed both a Pac-10 title and a trip to the Rose Bowl, the 10-0 Huskies entered the 1991 Apple Cup with their sights set on a national championship.</p>\n<p>In a seemingly lopsided matchup, the Cougars gave UW all it could handle -- for a while, at least. Washington’s 7-6 deficit after the first quarter marked just the second time all season the Huskies trailed a team after one quarter. And while WSU sophomore quarterback Drew Bledsoe offered a glimpse of what WSU fans would come to cherish – throwing for 430 yards that day against a stout Huskies defense – it was far from enough to take down the behemoth that Washington had become that season.</p>\n<p>Washington quarterbacks Joe Hobert and Mark Brunell combined for four touchdown passes on the day, while a late interception by UW safety Tommie Smith delivered the dagger to Washington State and its upset bid. Don James’ Huskies would go on to complete their unblemished 12-0 season en route to their second national title with a convincing 34-14 Rose Bowl victory over Michigan.",
    "youtube": "nWe_xrzDcYQ",
    "etc": "",
    "credit": "Rod Mar / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-huskies/huskies-1991-flashback-tommie-smiths-interception-in-apple-cup-sealed-big-win/",
    "linktext": "Huskies 1991 flashback: Tommie Smith’s interception in Apple Cup sealed big win\r\n",
    "poll": ""
  },
  {
    "title": "2",
    "order": "2",
    "rank": "2",
    "image": "2012Apple.jpg",
    "overlay": "right",
    "name": "Nov. 23, 2012: WSU 31, UW 28 (OT)",
    "subhead": "Comeback Cougs",
    "chatter": "In Mike Leach's first Apple Cup, the Cougars faced a 28-10 fourth-quarter deficit, seemingly destined for a disappointing 2-10 season. But, as we all know, crazy things can happen when these teams get together.<p>Staring an 18-point deficit squarely in the face, the Cougars didn't blink. Senior quarterback Jeff Tuel led two touchdown drives -- both capped by Carl Winston rushing scores -- and just like that, WSU was within striking distance. After the potential game-winning field goal by UW's Travis Coons sailed wide right, the Cougs forced a turnover in overtime and put the finishing touches on the largest Apple Cup comeback ever. ",
    "youtube": "ZkARl-S8SQY",
    "etc": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/wsu-cougar-football/remembering-cougarsrsquo-improbable-victory-in-2012-apple-cup/",
    "linktext": "Remembering Cougars’ improbable victory in 2012 Apple Cup",
    "poll": ""
  },
  {
    "title": "4",
    "order": "4",
    "rank": "4",
    "image": "1988Apple.jpg",
    "overlay": "left",
    "name": "Nov. 19, 1988: No. 19 WSU 32, UW 31",
    "subhead": "WSU holds on",
    "chatter": "Fresh off a three-game winning streak, including a win over top-ranked UCLA, the No. 19 Cougars entered the Apple Cup riding high. But UW quickly squelched any notions of a WSU blowout, storming out to a 12 point lead by halftime. <p>The Cougars, however, would not go away quietly on that snowy November day in Pullman.Quarterback Timm Rosenbach and the Cougar offense came back invigorated in the second half, quickly cutting the deficit to two points in the third quarter. Rosenback completed the comeback in the final quarter, taking the game-winning touchdown into the end zone himself. With just a one-point lead and nine minutes to play, the WSU defense dug in its heels, not allowing another score. ",
    "youtube": "YeuWcZN95sI",
    "etc": "",
    "credit": "Harley Soltes / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  },
  {
    "title": "3",
    "order": "3",
    "rank": "3",
    "image": "2003applecup.jpg",
    "overlay": "right",
    "name": "Nov. 22, 2003: UW 27, No. 8 WSU 19",
    "subhead": "Huskies pull off the upset",
    "chatter": "Not only did the Huskies take down the No. 8 Washington State Cougars in this all-time Apple Cup thriller, the 27-19 win salvaged a 6-6 season for the Huskies -- continuing a streak of 27 straight seasons without a losing record. As for WSU, this one stung. The Cougars finished 9-3, but were denied a third straight 10-win season, suffering a sixth-consecutive Apple Cup loss to their cross-state rivals. <p>The game itself was an all-timer. Trailing 19-14 with four minutes to play, the Huskies battled back behind the arm of Cody Picket to take a 20-19 lead. With 1:10 left, Picket iced the game, heaving a 21-yard strike to wide receiver Corey Williams, and moments later, elated fans stormed the field, climbing the goal posts to celebrate the upset. ",
    "youtube": "I--CPpv9tIU",
    "etc": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  },
  {
    "title": "4",
    "order": "4",
    "rank": "4",
    "image": "1981AppleCup.jpg",
    "overlay": "right",
    "name": "Nov. 21, 1981: No. 17 UW 23, No. 14 WSU 10",
    "subhead": "Huskies smelling roses",
    "chatter": "1981 was a year in which Cougs and Huskies alike yearn to replicate. It was an Apple Cup matchup for the ages, as the Cougs entered the game with an 8-1-1 record and looking to make their first Rose Bowl appearance in 50 years. Meanwhile, the Huskies – fresh off a Rose Bowl appearance of their own – entered the game with a record of 8-2, needing a win and a little help to get back to Pasadena. On that Seattle day, both the Pac-10 title and Rose Bowl were on the line – just like Cougar and Husky fans had always dreamed of.<p>\r\n\rThe game itself didn’t quite live up to the anticipation, at least not until after an unfortunate turn of events for the Cougars in the first half. Leading 7-3, and in complete control, WSU quarterback Clete Casper went down with an injury. After that, Washington took over and never looked back en route to a decisive 23-10 victory in front of a then record 60,052 Husky Stadium crowd.\r\n\r<p>The win was especially sweet for the Huskies, as the team received help by way of a USC victory over UCLA on that day to help buoy Washington to its second straight trip to Pasadena and third Rose Bowl appearance in just five years. Meanwhile, WSU was left with the bitter sting of defeat, having let a golden opportunity slip through their fingers.",
    "youtube": "jzwEnRLaNv4",
    "etc": "",
    "credit": "Barry Wongq / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  },
  {
    "title": "5",
    "order": "5",
    "rank": "5",
    "image": "2007Apple.jpg",
    "overlay": "right",
    "name": "Nov. 24, 2007: WSU 42, UW 35",
    "subhead": "Brink downs the Dawgs... again",
    "chatter": "The 100th meeting between the two teams also turned into one of the most thrilling. After falling behind 10-0 early, WSU rallied back to take a 28-20 lead in the second half. But Jake Locker and the Huskies would not go away, bouncing back for two scores of their own. <p>With the game knotted at 35-35 in the final minute, QB Alex Brink dropped back for a 35-yard strike to WR Brandon Gibson, delivering the dagger to UW. Brink ended the day with 399 yards and 5 TDs, while also securing his third win over UW in four tries -- most ever by a WSU quarterback.",
    "youtube": "7YOUKb2aTNc",
    "etc": "",
    "credit": "Mark Harrison / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/apple-cup-cougars-score-in-final-minute-win-42-35/",
    "linktext": "Cougars score in final minute, win Apple Cup 42-35",
    "poll": ""
  },
  {
    "title": "6",
    "order": "6",
    "rank": "6",
    "image": "1997RyanLeaf.jpg",
    "overlay": "right",
    "name": "Nov. 22, 1997: No. 11 WSU 41, No. 17 UW 35",
    "subhead": "A rosy day for the Cougs",
    "chatter": "The Huskies and Cougars combined for 76 points in one of the highest-scoring Apple Cups in history. While the Huskies entered the game 8-point favorites, the Cougars looked to be the more determined team throughout, taking a 10-point lead into halftime, and never relinquishing it. And despite a couple of comeback efforts by the Huskies, who cut the lead to three points twice, the Ryan Leaf-led Cougs would not be denied. The WSU win ensured the Cougars' first Rose Bowl trip in 67 years, and even Husky fans took notice of the moment, applauding the Cougars as they celebrated the victory.<p>\"There was no way we were going to lose to them,\" Leaf said after the game. \"There was no way we were going to lose to Washington. We worked too hard.\"\n\n",
    "youtube": "Rm7ONFZTc-I",
    "etc": "",
    "credit": "Rod Mar / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-husky-football/apple-cup-history-high-scoring-games/",
    "linktext": "Apple Cup history: high-scoring games\r\n",
    "poll": ""
  },
  {
    "title": "7",
    "order": "7",
    "rank": "7",
    "image": "2002Apple.jpg",
    "overlay": "left",
    "name": "Nov. 23, 2002: UW 29, No. 3 WSU 26",
    "subhead": "A call to remember",
    "chatter": "The Huskies entered this 2002 matchup as huge underdogs against the No. 3 WSU Cougars -- an Apple Cup rarity. Despite the odds, UW played inspired football in Seattle, looking to topple their foes to the east. Facing a 17-7 halftime deficit, Cody Pickett and the Huskies stormed back to tie the game in the second half, forcing overtime. <p>After trading blows in overtime, the game would be decided on one of the most controversial plays in Apple Cup history. The play came on a throw by backup quarterback Matt Kegel – in for the injured Jason Gesser. The pass, intended to be a screen pass the wide receiver ended up being batted down by defensive lineman Kai Ellis. But rather than being ruled an incompletion, referee Gordon Riese swiftly ended the game with a call that will ring in the ears of Huskies and Cougar fans forever:\n<p>\n“The ruling on the field was that it was a backwards pass. Washington recovered that pass, and the game is over.”",
    "youtube": "do9-xvoJg2Y",
    "etc": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-husky-football/ten-years-ago-huskies-won-a-wild-apple-cup-in-pullman/",
    "linktext": "Huskies win wild Apple Cup in Pullman",
    "poll": ""
  },
  {
    "title": "9",
    "order": "9",
    "rank": "9",
    "image": "1975AppleCup.jpg",
    "overlay": "right",
    "name": "Nov. 22, 1975: UW 28, WSU 27",
    "subhead": "Moon to Gaines",
    "chatter": "After a disappointing 5-5 start to the season, Husky fans were unsettled with the team and first-year coach Don James. Tensions only escalated after the Huskies fell behind the Cougars (3-7) by 13 points late in the game, after entering the contest as a double-digit favorite. <p>The Cougars had the ball and the lead in Husky territory when WSU coach Jim Sweeney opted for the knockout punch rather than settling for a field goal that likely would have iced the game. On fourth-and-one from the UW 14-yard line, WSU quarterback John Hopkins threw a pass over the middle that was picked off by UW safety Al Burleson and returned 93 yards for a touchdown.<p> The Huskies got the ball back With 1:58 to play and needed a touchdown to win. Quarterback Warren Moon heaved a deep pass toward wide receiver Spider Gaines. Two WSU defensive backs couldn’t pick it off, and the ball was tipped into the arms of Gaines, who took the ball the rest of the way for a touchdown and a 28-27 UW victory.\n\n",
    "youtube": "I8skfcOjrCg",
    "etc": "",
    "credit": "Vic Condiotty / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  },
  {
    "title": "10",
    "order": "10",
    "rank": "10",
    "image": "1992Apple.jpg",
    "overlay": "right",
    "name": "Nov. 21, 1992: WSU 42, No. 5 UW 21",
    "subhead": "Snow Bowl",
    "chatter": "If you ever want to make a Coug fan smile, all that is needed is two words: “Snow Bowl”.\nOn a blustery winter day in Pullman, and with the reigning national champions from across the state storming into town, Drew Bledsoe and the Cougars pulled out all the stops to make this an Apple Cup for the ages.<p> Perhaps the most famous pass in WSU history came on a third-quarter connection when Bledsoe found a diving Philip Bobo in the back of the end zone with a 44-yard pass. Bobo slid into a pile of snow underneath the goal posts as Bledsoe pumped his arms infront of the snow-covered Cougar faithful.",
    "youtube": "eykkSTEcVdg",
    "etc": "",
    "credit": "Rod Mar / The Seattle Times",
    "url": "",
    "linktext": "",
    "poll": ""
  },
  {
    "title": "11",
    "order": "11",
    "rank": "",
    "image": "uwapple.jpg",
    "overlay": "right",
    "name": "Huskies' viewpoint",
    "subhead": "",
    "chatter": "With a win, the 5-6 Huskies would secure a bowl birth and cap an encouraging season behind freshman quarterback Jake Browning. UW's stout defensive attack will be put to the test against the Mike Leach-led Cougars and their 'Air Raid' offense.",
    "youtube": "",
    "etc": "",
    "credit": "Lindsey Wasson\r / The Seattle Times\n ",
    "url": "http://www.seattletimes.com/sports/uw-husky-football/huskies-warm-up-for-showdown-with-cougars/",
    "linktext": "Huskies ready for showdown with Cougars",
    "poll": ""
  },
  {
    "title": "12",
    "order": "12",
    "rank": "",
    "image": "wsuapple.jpg",
    "overlay": "right",
    "name": "Cougars' viewpoint",
    "subhead": "",
    "chatter": "With a win, the 8-3 Cougars would cap one of the more improbable comeback seasons in recent memory. After a crushing opening loss to Portland State, the Cougars have rebounded admirably behind a conference-leading passing attack and a much-improved defense. A win would elevate WSU's bowl bid and lock up the program's first 9-win season since 2003, when the Cougs finished 10-3.",
    "youtube": "",
    "etc": "",
    "credit": "Dean Rutz / The Seattle Times",
    "url": "http://www.seattletimes.com/sports/uw-husky-football/why-this-years-apple-cup-is-the-most-relevant-since-2003/",
    "linktext": "Why this year’s Apple Cup is the most relevant since 2003\r\n",
    "poll": ""
  }
]